# 大体同じものが出力されるはずだが，表示される順番が異なることがあるので注意．
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]           1,728
            Conv2d-2           [-1, 64, 32, 32]           1,728
       BatchNorm2d-3           [-1, 64, 32, 32]             128
       BatchNorm2d-4           [-1, 64, 32, 32]             128
            Conv2d-5           [-1, 64, 32, 32]           4,096
            Conv2d-6           [-1, 64, 32, 32]           4,096
       BatchNorm2d-7           [-1, 64, 32, 32]             128
       BatchNorm2d-8           [-1, 64, 32, 32]             128
            Conv2d-9           [-1, 64, 32, 32]          36,864
           Conv2d-10           [-1, 64, 32, 32]          36,864
      BatchNorm2d-11           [-1, 64, 32, 32]             128
      BatchNorm2d-12           [-1, 64, 32, 32]             128
           Conv2d-13          [-1, 256, 32, 32]          16,384
      BatchNorm2d-14          [-1, 256, 32, 32]             512
           Conv2d-15          [-1, 256, 32, 32]          16,384
           Conv2d-16          [-1, 256, 32, 32]          16,384
      BatchNorm2d-17          [-1, 256, 32, 32]             512
       Bottleneck-18          [-1, 256, 32, 32]               0
      BatchNorm2d-19          [-1, 256, 32, 32]             512
           Conv2d-20          [-1, 256, 32, 32]          16,384
      BatchNorm2d-21          [-1, 256, 32, 32]             512
       Bottleneck-22          [-1, 256, 32, 32]               0
           Conv2d-23           [-1, 64, 32, 32]          16,384
      BatchNorm2d-24           [-1, 64, 32, 32]             128
           Conv2d-25           [-1, 64, 32, 32]          36,864
           Conv2d-26           [-1, 64, 32, 32]          16,384
      BatchNorm2d-27           [-1, 64, 32, 32]             128
           Conv2d-28          [-1, 256, 32, 32]          16,384
      BatchNorm2d-29           [-1, 64, 32, 32]             128
      BatchNorm2d-30          [-1, 256, 32, 32]             512
           Conv2d-31           [-1, 64, 32, 32]          36,864
       Bottleneck-32          [-1, 256, 32, 32]               0
           Conv2d-33           [-1, 64, 32, 32]          16,384
      BatchNorm2d-34           [-1, 64, 32, 32]             128
      BatchNorm2d-35           [-1, 64, 32, 32]             128
           Conv2d-36          [-1, 256, 32, 32]          16,384
           Conv2d-37           [-1, 64, 32, 32]          36,864
      BatchNorm2d-38          [-1, 256, 32, 32]             512
      BatchNorm2d-39           [-1, 64, 32, 32]             128
       Bottleneck-40          [-1, 256, 32, 32]               0
           Conv2d-41          [-1, 256, 32, 32]          16,384
           Conv2d-42           [-1, 64, 32, 32]          16,384
      BatchNorm2d-43          [-1, 256, 32, 32]             512
      BatchNorm2d-44           [-1, 64, 32, 32]             128
       Bottleneck-45          [-1, 256, 32, 32]               0
           Conv2d-46           [-1, 64, 32, 32]          36,864
      BatchNorm2d-47           [-1, 64, 32, 32]             128
           Conv2d-48          [-1, 256, 32, 32]          16,384
      BatchNorm2d-49          [-1, 256, 32, 32]             512
       Bottleneck-50          [-1, 256, 32, 32]               0
           Conv2d-51          [-1, 128, 32, 32]          32,768
           Conv2d-52          [-1, 128, 32, 32]          32,768
      BatchNorm2d-53          [-1, 128, 32, 32]             256
      BatchNorm2d-54          [-1, 128, 32, 32]             256
           Conv2d-55          [-1, 128, 16, 16]         147,456
      BatchNorm2d-56          [-1, 128, 16, 16]             256
           Conv2d-57          [-1, 128, 16, 16]         147,456
           Conv2d-58          [-1, 512, 16, 16]          65,536
      BatchNorm2d-59          [-1, 128, 16, 16]             256
      BatchNorm2d-60          [-1, 512, 16, 16]           1,024
           Conv2d-61          [-1, 512, 16, 16]          65,536
      BatchNorm2d-62          [-1, 512, 16, 16]           1,024
           Conv2d-63          [-1, 512, 16, 16]         131,072
      BatchNorm2d-64          [-1, 512, 16, 16]           1,024
           Conv2d-65          [-1, 512, 16, 16]         131,072
       Bottleneck-66          [-1, 512, 16, 16]               0
      BatchNorm2d-67          [-1, 512, 16, 16]           1,024
       Bottleneck-68          [-1, 512, 16, 16]               0
           Conv2d-69          [-1, 128, 16, 16]          65,536
      BatchNorm2d-70          [-1, 128, 16, 16]             256
           Conv2d-71          [-1, 128, 16, 16]          65,536
      BatchNorm2d-72          [-1, 128, 16, 16]             256
           Conv2d-73          [-1, 128, 16, 16]         147,456
           Conv2d-74          [-1, 128, 16, 16]         147,456
      BatchNorm2d-75          [-1, 128, 16, 16]             256
      BatchNorm2d-76          [-1, 128, 16, 16]             256
           Conv2d-77          [-1, 512, 16, 16]          65,536
           Conv2d-78          [-1, 512, 16, 16]          65,536
      BatchNorm2d-79          [-1, 512, 16, 16]           1,024
      BatchNorm2d-80          [-1, 512, 16, 16]           1,024
       Bottleneck-81          [-1, 512, 16, 16]               0
       Bottleneck-82          [-1, 512, 16, 16]               0
           Conv2d-83          [-1, 128, 16, 16]          65,536
           Conv2d-84          [-1, 128, 16, 16]          65,536
      BatchNorm2d-85          [-1, 128, 16, 16]             256
      BatchNorm2d-86          [-1, 128, 16, 16]             256
           Conv2d-87          [-1, 128, 16, 16]         147,456
           Conv2d-88          [-1, 128, 16, 16]         147,456
      BatchNorm2d-89          [-1, 128, 16, 16]             256
      BatchNorm2d-90          [-1, 128, 16, 16]             256
           Conv2d-91          [-1, 512, 16, 16]          65,536
           Conv2d-92          [-1, 512, 16, 16]          65,536
      BatchNorm2d-93          [-1, 512, 16, 16]           1,024
      BatchNorm2d-94          [-1, 512, 16, 16]           1,024
       Bottleneck-95          [-1, 512, 16, 16]               0
       Bottleneck-96          [-1, 512, 16, 16]               0
           Conv2d-97          [-1, 128, 16, 16]          65,536
           Conv2d-98          [-1, 128, 16, 16]          65,536
      BatchNorm2d-99          [-1, 128, 16, 16]             256
     BatchNorm2d-100          [-1, 128, 16, 16]             256
          Conv2d-101          [-1, 128, 16, 16]         147,456
          Conv2d-102          [-1, 128, 16, 16]         147,456
     BatchNorm2d-103          [-1, 128, 16, 16]             256
     BatchNorm2d-104          [-1, 128, 16, 16]             256
          Conv2d-105          [-1, 512, 16, 16]          65,536
          Conv2d-106          [-1, 512, 16, 16]          65,536
     BatchNorm2d-107          [-1, 512, 16, 16]           1,024
      Bottleneck-108          [-1, 512, 16, 16]               0
     BatchNorm2d-109          [-1, 512, 16, 16]           1,024
          Conv2d-110          [-1, 128, 16, 16]          65,536
      Bottleneck-111          [-1, 512, 16, 16]               0
     BatchNorm2d-112          [-1, 128, 16, 16]             256
          Conv2d-113          [-1, 128, 16, 16]          65,536
          Conv2d-114          [-1, 128, 16, 16]         147,456
     BatchNorm2d-115          [-1, 128, 16, 16]             256
     BatchNorm2d-116          [-1, 128, 16, 16]             256
          Conv2d-117          [-1, 128, 16, 16]         147,456
          Conv2d-118          [-1, 512, 16, 16]          65,536
     BatchNorm2d-119          [-1, 128, 16, 16]             256
     BatchNorm2d-120          [-1, 512, 16, 16]           1,024
      Bottleneck-121          [-1, 512, 16, 16]               0
          Conv2d-122          [-1, 512, 16, 16]          65,536
          Conv2d-123          [-1, 128, 16, 16]          65,536
     BatchNorm2d-124          [-1, 128, 16, 16]             256
     BatchNorm2d-125          [-1, 512, 16, 16]           1,024
      Bottleneck-126          [-1, 512, 16, 16]               0
          Conv2d-127          [-1, 128, 16, 16]         147,456
          Conv2d-128          [-1, 128, 16, 16]          65,536
     BatchNorm2d-129          [-1, 128, 16, 16]             256
     BatchNorm2d-130          [-1, 128, 16, 16]             256
          Conv2d-131          [-1, 512, 16, 16]          65,536
          Conv2d-132          [-1, 128, 16, 16]         147,456
     BatchNorm2d-133          [-1, 512, 16, 16]           1,024
     BatchNorm2d-134          [-1, 128, 16, 16]             256
      Bottleneck-135          [-1, 512, 16, 16]               0
          Conv2d-136          [-1, 512, 16, 16]          65,536
          Conv2d-137          [-1, 128, 16, 16]          65,536
     BatchNorm2d-138          [-1, 128, 16, 16]             256
     BatchNorm2d-139          [-1, 512, 16, 16]           1,024
          Conv2d-140          [-1, 128, 16, 16]         147,456
      Bottleneck-141          [-1, 512, 16, 16]               0
     BatchNorm2d-142          [-1, 128, 16, 16]             256
          Conv2d-143          [-1, 128, 16, 16]          65,536
     BatchNorm2d-144          [-1, 128, 16, 16]             256
          Conv2d-145          [-1, 512, 16, 16]          65,536
     BatchNorm2d-146          [-1, 512, 16, 16]           1,024
          Conv2d-147          [-1, 128, 16, 16]         147,456
      Bottleneck-148          [-1, 512, 16, 16]               0
     BatchNorm2d-149          [-1, 128, 16, 16]             256
          Conv2d-150          [-1, 128, 16, 16]          65,536
     BatchNorm2d-151          [-1, 128, 16, 16]             256
          Conv2d-152          [-1, 512, 16, 16]          65,536
     BatchNorm2d-153          [-1, 512, 16, 16]           1,024
          Conv2d-154          [-1, 128, 16, 16]         147,456
      Bottleneck-155          [-1, 512, 16, 16]               0
     BatchNorm2d-156          [-1, 128, 16, 16]             256
          Conv2d-157          [-1, 128, 16, 16]          65,536
     BatchNorm2d-158          [-1, 128, 16, 16]             256
          Conv2d-159          [-1, 512, 16, 16]          65,536
     BatchNorm2d-160          [-1, 512, 16, 16]           1,024
          Conv2d-161          [-1, 128, 16, 16]         147,456
      Bottleneck-162          [-1, 512, 16, 16]               0
     BatchNorm2d-163          [-1, 128, 16, 16]             256
          Conv2d-164          [-1, 512, 16, 16]          65,536
     BatchNorm2d-165          [-1, 512, 16, 16]           1,024
      Bottleneck-166          [-1, 512, 16, 16]               0
          Conv2d-167          [-1, 256, 16, 16]         131,072
          Conv2d-168          [-1, 256, 16, 16]         131,072
     BatchNorm2d-169          [-1, 256, 16, 16]             512
     BatchNorm2d-170          [-1, 256, 16, 16]             512
          Conv2d-171            [-1, 256, 8, 8]         589,824
     BatchNorm2d-172            [-1, 256, 8, 8]             512
          Conv2d-173            [-1, 256, 8, 8]         589,824
     BatchNorm2d-174            [-1, 256, 8, 8]             512
          Conv2d-175           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-176           [-1, 1024, 8, 8]           2,048
          Conv2d-177           [-1, 1024, 8, 8]         524,288
     BatchNorm2d-178           [-1, 1024, 8, 8]           2,048
      Bottleneck-179           [-1, 1024, 8, 8]               0
          Conv2d-180           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-181           [-1, 1024, 8, 8]           2,048
          Conv2d-182           [-1, 1024, 8, 8]         524,288
     BatchNorm2d-183           [-1, 1024, 8, 8]           2,048
      Bottleneck-184           [-1, 1024, 8, 8]               0
          Conv2d-185            [-1, 256, 8, 8]         262,144
     BatchNorm2d-186            [-1, 256, 8, 8]             512
          Conv2d-187            [-1, 256, 8, 8]         262,144
     BatchNorm2d-188            [-1, 256, 8, 8]             512
          Conv2d-189            [-1, 256, 8, 8]         589,824
     BatchNorm2d-190            [-1, 256, 8, 8]             512
          Conv2d-191           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-192           [-1, 1024, 8, 8]           2,048
      Bottleneck-193           [-1, 1024, 8, 8]               0
          Conv2d-194            [-1, 256, 8, 8]         262,144
     BatchNorm2d-195            [-1, 256, 8, 8]             512
          Conv2d-196            [-1, 256, 8, 8]         589,824
     BatchNorm2d-197            [-1, 256, 8, 8]             512
          Conv2d-198           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-199           [-1, 1024, 8, 8]           2,048
      Bottleneck-200           [-1, 1024, 8, 8]               0
          Conv2d-201            [-1, 256, 8, 8]         262,144
     BatchNorm2d-202            [-1, 256, 8, 8]             512
          Conv2d-203            [-1, 256, 8, 8]         589,824
          Conv2d-204            [-1, 256, 8, 8]         589,824
     BatchNorm2d-205            [-1, 256, 8, 8]             512
     BatchNorm2d-206            [-1, 256, 8, 8]             512
          Conv2d-207           [-1, 1024, 8, 8]         262,144
          Conv2d-208           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-209           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-210           [-1, 1024, 8, 8]           2,048
      Bottleneck-211           [-1, 1024, 8, 8]               0
      Bottleneck-212           [-1, 1024, 8, 8]               0
          Conv2d-213            [-1, 256, 8, 8]         262,144
          Conv2d-214            [-1, 256, 8, 8]         262,144
     BatchNorm2d-215            [-1, 256, 8, 8]             512
     BatchNorm2d-216            [-1, 256, 8, 8]             512
          Conv2d-217            [-1, 256, 8, 8]         589,824
          Conv2d-218            [-1, 256, 8, 8]         589,824
     BatchNorm2d-219            [-1, 256, 8, 8]             512
     BatchNorm2d-220            [-1, 256, 8, 8]             512
          Conv2d-221           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-222           [-1, 1024, 8, 8]           2,048
          Conv2d-223           [-1, 1024, 8, 8]         262,144
      Bottleneck-224           [-1, 1024, 8, 8]               0
     BatchNorm2d-225           [-1, 1024, 8, 8]           2,048
          Conv2d-226            [-1, 256, 8, 8]         262,144
      Bottleneck-227           [-1, 1024, 8, 8]               0
     BatchNorm2d-228            [-1, 256, 8, 8]             512
          Conv2d-229            [-1, 256, 8, 8]         262,144
          Conv2d-230            [-1, 256, 8, 8]         589,824
     BatchNorm2d-231            [-1, 256, 8, 8]             512
     BatchNorm2d-232            [-1, 256, 8, 8]             512
          Conv2d-233            [-1, 256, 8, 8]         589,824
          Conv2d-234           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-235            [-1, 256, 8, 8]             512
     BatchNorm2d-236           [-1, 1024, 8, 8]           2,048
      Bottleneck-237           [-1, 1024, 8, 8]               0
          Conv2d-238           [-1, 1024, 8, 8]         262,144
          Conv2d-239            [-1, 256, 8, 8]         262,144
     BatchNorm2d-240           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-241            [-1, 256, 8, 8]             512
      Bottleneck-242           [-1, 1024, 8, 8]               0
          Conv2d-243            [-1, 256, 8, 8]         262,144
          Conv2d-244            [-1, 256, 8, 8]         589,824
     BatchNorm2d-245            [-1, 256, 8, 8]             512
     BatchNorm2d-246            [-1, 256, 8, 8]             512
          Conv2d-247           [-1, 1024, 8, 8]         262,144
          Conv2d-248            [-1, 256, 8, 8]         589,824
     BatchNorm2d-249            [-1, 256, 8, 8]             512
     BatchNorm2d-250           [-1, 1024, 8, 8]           2,048
      Bottleneck-251           [-1, 1024, 8, 8]               0
          Conv2d-252           [-1, 1024, 8, 8]         262,144
          Conv2d-253            [-1, 256, 8, 8]         262,144
     BatchNorm2d-254           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-255            [-1, 256, 8, 8]             512
      Bottleneck-256           [-1, 1024, 8, 8]               0
          Conv2d-257            [-1, 256, 8, 8]         589,824
          Conv2d-258            [-1, 256, 8, 8]         262,144
     BatchNorm2d-259            [-1, 256, 8, 8]             512
     BatchNorm2d-260            [-1, 256, 8, 8]             512
          Conv2d-261           [-1, 1024, 8, 8]         262,144
          Conv2d-262            [-1, 256, 8, 8]         589,824
     BatchNorm2d-263           [-1, 1024, 8, 8]           2,048
      Bottleneck-264           [-1, 1024, 8, 8]               0
     BatchNorm2d-265            [-1, 256, 8, 8]             512
          Conv2d-266            [-1, 256, 8, 8]         262,144
          Conv2d-267           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-268            [-1, 256, 8, 8]             512
     BatchNorm2d-269           [-1, 1024, 8, 8]           2,048
          Conv2d-270            [-1, 256, 8, 8]         589,824
      Bottleneck-271           [-1, 1024, 8, 8]               0
     BatchNorm2d-272            [-1, 256, 8, 8]             512
          Conv2d-273            [-1, 256, 8, 8]         262,144
     BatchNorm2d-274            [-1, 256, 8, 8]             512
          Conv2d-275           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-276           [-1, 1024, 8, 8]           2,048
          Conv2d-277            [-1, 256, 8, 8]         589,824
      Bottleneck-278           [-1, 1024, 8, 8]               0
     BatchNorm2d-279            [-1, 256, 8, 8]             512
          Conv2d-280            [-1, 256, 8, 8]         262,144
          Conv2d-281           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-282            [-1, 256, 8, 8]             512
          Conv2d-283            [-1, 256, 8, 8]         589,824
     BatchNorm2d-284           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-285            [-1, 256, 8, 8]             512
      Bottleneck-286           [-1, 1024, 8, 8]               0
          Conv2d-287            [-1, 256, 8, 8]         262,144
          Conv2d-288           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-289            [-1, 256, 8, 8]             512
     BatchNorm2d-290           [-1, 1024, 8, 8]           2,048
          Conv2d-291            [-1, 256, 8, 8]         589,824
      Bottleneck-292           [-1, 1024, 8, 8]               0
          Conv2d-293            [-1, 256, 8, 8]         262,144
     BatchNorm2d-294            [-1, 256, 8, 8]             512
     BatchNorm2d-295            [-1, 256, 8, 8]             512
          Conv2d-296           [-1, 1024, 8, 8]         262,144
          Conv2d-297            [-1, 256, 8, 8]         589,824
     BatchNorm2d-298           [-1, 1024, 8, 8]           2,048
      Bottleneck-299           [-1, 1024, 8, 8]               0
     BatchNorm2d-300            [-1, 256, 8, 8]             512
          Conv2d-301            [-1, 256, 8, 8]         262,144
          Conv2d-302           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-303            [-1, 256, 8, 8]             512
     BatchNorm2d-304           [-1, 1024, 8, 8]           2,048
          Conv2d-305            [-1, 256, 8, 8]         589,824
      Bottleneck-306           [-1, 1024, 8, 8]               0
     BatchNorm2d-307            [-1, 256, 8, 8]             512
          Conv2d-308            [-1, 256, 8, 8]         262,144
     BatchNorm2d-309            [-1, 256, 8, 8]             512
          Conv2d-310           [-1, 1024, 8, 8]         262,144
          Conv2d-311            [-1, 256, 8, 8]         589,824
     BatchNorm2d-312           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-313            [-1, 256, 8, 8]             512
      Bottleneck-314           [-1, 1024, 8, 8]               0
          Conv2d-315           [-1, 1024, 8, 8]         262,144
          Conv2d-316            [-1, 256, 8, 8]         262,144
     BatchNorm2d-317           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-318            [-1, 256, 8, 8]             512
      Bottleneck-319           [-1, 1024, 8, 8]               0
          Conv2d-320            [-1, 256, 8, 8]         589,824
          Conv2d-321            [-1, 256, 8, 8]         262,144
     BatchNorm2d-322            [-1, 256, 8, 8]             512
     BatchNorm2d-323            [-1, 256, 8, 8]             512
          Conv2d-324            [-1, 256, 8, 8]         589,824
          Conv2d-325           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-326            [-1, 256, 8, 8]             512
     BatchNorm2d-327           [-1, 1024, 8, 8]           2,048
      Bottleneck-328           [-1, 1024, 8, 8]               0
          Conv2d-329           [-1, 1024, 8, 8]         262,144
          Conv2d-330            [-1, 256, 8, 8]         262,144
     BatchNorm2d-331           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-332            [-1, 256, 8, 8]             512
      Bottleneck-333           [-1, 1024, 8, 8]               0
          Conv2d-334            [-1, 256, 8, 8]         262,144
          Conv2d-335            [-1, 256, 8, 8]         589,824
     BatchNorm2d-336            [-1, 256, 8, 8]             512
     BatchNorm2d-337            [-1, 256, 8, 8]             512
          Conv2d-338            [-1, 256, 8, 8]         589,824
     BatchNorm2d-339            [-1, 256, 8, 8]             512
          Conv2d-340           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-341           [-1, 1024, 8, 8]           2,048
          Conv2d-342           [-1, 1024, 8, 8]         262,144
      Bottleneck-343           [-1, 1024, 8, 8]               0
     BatchNorm2d-344           [-1, 1024, 8, 8]           2,048
          Conv2d-345            [-1, 256, 8, 8]         262,144
      Bottleneck-346           [-1, 1024, 8, 8]               0
     BatchNorm2d-347            [-1, 256, 8, 8]             512
          Conv2d-348            [-1, 256, 8, 8]         262,144
          Conv2d-349            [-1, 256, 8, 8]         589,824
     BatchNorm2d-350            [-1, 256, 8, 8]             512
     BatchNorm2d-351            [-1, 256, 8, 8]             512
          Conv2d-352            [-1, 256, 8, 8]         589,824
          Conv2d-353           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-354            [-1, 256, 8, 8]             512
     BatchNorm2d-355           [-1, 1024, 8, 8]           2,048
          Conv2d-356           [-1, 1024, 8, 8]         262,144
      Bottleneck-357           [-1, 1024, 8, 8]               0
     BatchNorm2d-358           [-1, 1024, 8, 8]           2,048
      Bottleneck-359           [-1, 1024, 8, 8]               0
          Conv2d-360            [-1, 256, 8, 8]         262,144
          Conv2d-361            [-1, 256, 8, 8]         262,144
     BatchNorm2d-362            [-1, 256, 8, 8]             512
     BatchNorm2d-363            [-1, 256, 8, 8]             512
          Conv2d-364            [-1, 256, 8, 8]         589,824
          Conv2d-365            [-1, 256, 8, 8]         589,824
     BatchNorm2d-366            [-1, 256, 8, 8]             512
     BatchNorm2d-367            [-1, 256, 8, 8]             512
          Conv2d-368           [-1, 1024, 8, 8]         262,144
          Conv2d-369           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-370           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-371           [-1, 1024, 8, 8]           2,048
      Bottleneck-372           [-1, 1024, 8, 8]               0
      Bottleneck-373           [-1, 1024, 8, 8]               0
          Conv2d-374            [-1, 256, 8, 8]         262,144
          Conv2d-375            [-1, 256, 8, 8]         262,144
     BatchNorm2d-376            [-1, 256, 8, 8]             512
     BatchNorm2d-377            [-1, 256, 8, 8]             512
          Conv2d-378            [-1, 256, 8, 8]         589,824
          Conv2d-379            [-1, 256, 8, 8]         589,824
     BatchNorm2d-380            [-1, 256, 8, 8]             512
     BatchNorm2d-381            [-1, 256, 8, 8]             512
          Conv2d-382           [-1, 1024, 8, 8]         262,144
          Conv2d-383           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-384           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-385           [-1, 1024, 8, 8]           2,048
      Bottleneck-386           [-1, 1024, 8, 8]               0
      Bottleneck-387           [-1, 1024, 8, 8]               0
          Conv2d-388            [-1, 256, 8, 8]         262,144
          Conv2d-389            [-1, 256, 8, 8]         262,144
     BatchNorm2d-390            [-1, 256, 8, 8]             512
     BatchNorm2d-391            [-1, 256, 8, 8]             512
          Conv2d-392            [-1, 256, 8, 8]         589,824
          Conv2d-393            [-1, 256, 8, 8]         589,824
     BatchNorm2d-394            [-1, 256, 8, 8]             512
     BatchNorm2d-395            [-1, 256, 8, 8]             512
          Conv2d-396           [-1, 1024, 8, 8]         262,144
          Conv2d-397           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-398           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-399           [-1, 1024, 8, 8]           2,048
      Bottleneck-400           [-1, 1024, 8, 8]               0
      Bottleneck-401           [-1, 1024, 8, 8]               0
          Conv2d-402            [-1, 256, 8, 8]         262,144
          Conv2d-403            [-1, 256, 8, 8]         262,144
     BatchNorm2d-404            [-1, 256, 8, 8]             512
     BatchNorm2d-405            [-1, 256, 8, 8]             512
          Conv2d-406            [-1, 256, 8, 8]         589,824
          Conv2d-407            [-1, 256, 8, 8]         589,824
     BatchNorm2d-408            [-1, 256, 8, 8]             512
     BatchNorm2d-409            [-1, 256, 8, 8]             512
          Conv2d-410           [-1, 1024, 8, 8]         262,144
          Conv2d-411           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-412           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-413           [-1, 1024, 8, 8]           2,048
      Bottleneck-414           [-1, 1024, 8, 8]               0
      Bottleneck-415           [-1, 1024, 8, 8]               0
          Conv2d-416            [-1, 256, 8, 8]         262,144
          Conv2d-417            [-1, 256, 8, 8]         262,144
     BatchNorm2d-418            [-1, 256, 8, 8]             512
     BatchNorm2d-419            [-1, 256, 8, 8]             512
          Conv2d-420            [-1, 256, 8, 8]         589,824
          Conv2d-421            [-1, 256, 8, 8]         589,824
     BatchNorm2d-422            [-1, 256, 8, 8]             512
     BatchNorm2d-423            [-1, 256, 8, 8]             512
          Conv2d-424           [-1, 1024, 8, 8]         262,144
          Conv2d-425           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-426           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-427           [-1, 1024, 8, 8]           2,048
      Bottleneck-428           [-1, 1024, 8, 8]               0
      Bottleneck-429           [-1, 1024, 8, 8]               0
          Conv2d-430            [-1, 256, 8, 8]         262,144
          Conv2d-431            [-1, 256, 8, 8]         262,144
     BatchNorm2d-432            [-1, 256, 8, 8]             512
     BatchNorm2d-433            [-1, 256, 8, 8]             512
          Conv2d-434            [-1, 256, 8, 8]         589,824
          Conv2d-435            [-1, 256, 8, 8]         589,824
     BatchNorm2d-436            [-1, 256, 8, 8]             512
     BatchNorm2d-437            [-1, 256, 8, 8]             512
          Conv2d-438           [-1, 1024, 8, 8]         262,144
          Conv2d-439           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-440           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-441           [-1, 1024, 8, 8]           2,048
      Bottleneck-442           [-1, 1024, 8, 8]               0
      Bottleneck-443           [-1, 1024, 8, 8]               0
          Conv2d-444            [-1, 256, 8, 8]         262,144
          Conv2d-445            [-1, 256, 8, 8]         262,144
     BatchNorm2d-446            [-1, 256, 8, 8]             512
     BatchNorm2d-447            [-1, 256, 8, 8]             512
          Conv2d-448            [-1, 256, 8, 8]         589,824
          Conv2d-449            [-1, 256, 8, 8]         589,824
     BatchNorm2d-450            [-1, 256, 8, 8]             512
     BatchNorm2d-451            [-1, 256, 8, 8]             512
          Conv2d-452           [-1, 1024, 8, 8]         262,144
          Conv2d-453           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-454           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-455           [-1, 1024, 8, 8]           2,048
      Bottleneck-456           [-1, 1024, 8, 8]               0
      Bottleneck-457           [-1, 1024, 8, 8]               0
          Conv2d-458            [-1, 256, 8, 8]         262,144
          Conv2d-459            [-1, 256, 8, 8]         262,144
     BatchNorm2d-460            [-1, 256, 8, 8]             512
     BatchNorm2d-461            [-1, 256, 8, 8]             512
          Conv2d-462            [-1, 256, 8, 8]         589,824
          Conv2d-463            [-1, 256, 8, 8]         589,824
     BatchNorm2d-464            [-1, 256, 8, 8]             512
     BatchNorm2d-465            [-1, 256, 8, 8]             512
          Conv2d-466           [-1, 1024, 8, 8]         262,144
          Conv2d-467           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-468           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-469           [-1, 1024, 8, 8]           2,048
      Bottleneck-470           [-1, 1024, 8, 8]               0
      Bottleneck-471           [-1, 1024, 8, 8]               0
          Conv2d-472            [-1, 256, 8, 8]         262,144
          Conv2d-473            [-1, 256, 8, 8]         262,144
     BatchNorm2d-474            [-1, 256, 8, 8]             512
     BatchNorm2d-475            [-1, 256, 8, 8]             512
          Conv2d-476            [-1, 256, 8, 8]         589,824
          Conv2d-477            [-1, 256, 8, 8]         589,824
     BatchNorm2d-478            [-1, 256, 8, 8]             512
     BatchNorm2d-479            [-1, 256, 8, 8]             512
          Conv2d-480           [-1, 1024, 8, 8]         262,144
          Conv2d-481           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-482           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-483           [-1, 1024, 8, 8]           2,048
      Bottleneck-484           [-1, 1024, 8, 8]               0
      Bottleneck-485           [-1, 1024, 8, 8]               0
          Conv2d-486            [-1, 256, 8, 8]         262,144
          Conv2d-487            [-1, 256, 8, 8]         262,144
     BatchNorm2d-488            [-1, 256, 8, 8]             512
     BatchNorm2d-489            [-1, 256, 8, 8]             512
          Conv2d-490            [-1, 256, 8, 8]         589,824
          Conv2d-491            [-1, 256, 8, 8]         589,824
     BatchNorm2d-492            [-1, 256, 8, 8]             512
     BatchNorm2d-493            [-1, 256, 8, 8]             512
          Conv2d-494           [-1, 1024, 8, 8]         262,144
          Conv2d-495           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-496           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-497           [-1, 1024, 8, 8]           2,048
      Bottleneck-498           [-1, 1024, 8, 8]               0
          Conv2d-499            [-1, 256, 8, 8]         262,144
      Bottleneck-500           [-1, 1024, 8, 8]               0
          Conv2d-501            [-1, 256, 8, 8]         262,144
     BatchNorm2d-502            [-1, 256, 8, 8]             512
     BatchNorm2d-503            [-1, 256, 8, 8]             512
          Conv2d-504            [-1, 256, 8, 8]         589,824
     BatchNorm2d-505            [-1, 256, 8, 8]             512
          Conv2d-506            [-1, 256, 8, 8]         589,824
     BatchNorm2d-507            [-1, 256, 8, 8]             512
          Conv2d-508           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-509           [-1, 1024, 8, 8]           2,048
          Conv2d-510           [-1, 1024, 8, 8]         262,144
      Bottleneck-511           [-1, 1024, 8, 8]               0
     BatchNorm2d-512           [-1, 1024, 8, 8]           2,048
          Conv2d-513            [-1, 256, 8, 8]         262,144
      Bottleneck-514           [-1, 1024, 8, 8]               0
     BatchNorm2d-515            [-1, 256, 8, 8]             512
          Conv2d-516            [-1, 256, 8, 8]         262,144
          Conv2d-517            [-1, 256, 8, 8]         589,824
     BatchNorm2d-518            [-1, 256, 8, 8]             512
     BatchNorm2d-519            [-1, 256, 8, 8]             512
          Conv2d-520            [-1, 256, 8, 8]         589,824
          Conv2d-521           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-522            [-1, 256, 8, 8]             512
     BatchNorm2d-523           [-1, 1024, 8, 8]           2,048
          Conv2d-524           [-1, 1024, 8, 8]         262,144
      Bottleneck-525           [-1, 1024, 8, 8]               0
     BatchNorm2d-526           [-1, 1024, 8, 8]           2,048
          Conv2d-527            [-1, 256, 8, 8]         262,144
      Bottleneck-528           [-1, 1024, 8, 8]               0
     BatchNorm2d-529            [-1, 256, 8, 8]             512
          Conv2d-530            [-1, 256, 8, 8]         262,144
     BatchNorm2d-531            [-1, 256, 8, 8]             512
          Conv2d-532            [-1, 256, 8, 8]         589,824
     BatchNorm2d-533            [-1, 256, 8, 8]             512
          Conv2d-534            [-1, 256, 8, 8]         589,824
     BatchNorm2d-535            [-1, 256, 8, 8]             512
          Conv2d-536           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-537           [-1, 1024, 8, 8]           2,048
          Conv2d-538           [-1, 1024, 8, 8]         262,144
      Bottleneck-539           [-1, 1024, 8, 8]               0
     BatchNorm2d-540           [-1, 1024, 8, 8]           2,048
          Conv2d-541            [-1, 256, 8, 8]         262,144
      Bottleneck-542           [-1, 1024, 8, 8]               0
          Conv2d-543            [-1, 256, 8, 8]         262,144
     BatchNorm2d-544            [-1, 256, 8, 8]             512
     BatchNorm2d-545            [-1, 256, 8, 8]             512
          Conv2d-546            [-1, 256, 8, 8]         589,824
     BatchNorm2d-547            [-1, 256, 8, 8]             512
          Conv2d-548            [-1, 256, 8, 8]         589,824
     BatchNorm2d-549            [-1, 256, 8, 8]             512
          Conv2d-550           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-551           [-1, 1024, 8, 8]           2,048
          Conv2d-552           [-1, 1024, 8, 8]         262,144
      Bottleneck-553           [-1, 1024, 8, 8]               0
     BatchNorm2d-554           [-1, 1024, 8, 8]           2,048
          Conv2d-555            [-1, 256, 8, 8]         262,144
      Bottleneck-556           [-1, 1024, 8, 8]               0
     BatchNorm2d-557            [-1, 256, 8, 8]             512
          Conv2d-558            [-1, 256, 8, 8]         262,144
          Conv2d-559            [-1, 256, 8, 8]         589,824
     BatchNorm2d-560            [-1, 256, 8, 8]             512
     BatchNorm2d-561            [-1, 256, 8, 8]             512
          Conv2d-562            [-1, 256, 8, 8]         589,824
          Conv2d-563           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-564            [-1, 256, 8, 8]             512
     BatchNorm2d-565           [-1, 1024, 8, 8]           2,048
      Bottleneck-566           [-1, 1024, 8, 8]               0
          Conv2d-567           [-1, 1024, 8, 8]         262,144
          Conv2d-568            [-1, 256, 8, 8]         262,144
     BatchNorm2d-569           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-570            [-1, 256, 8, 8]             512
      Bottleneck-571           [-1, 1024, 8, 8]               0
          Conv2d-572            [-1, 256, 8, 8]         589,824
          Conv2d-573            [-1, 256, 8, 8]         262,144
     BatchNorm2d-574            [-1, 256, 8, 8]             512
     BatchNorm2d-575            [-1, 256, 8, 8]             512
          Conv2d-576           [-1, 1024, 8, 8]         262,144
          Conv2d-577            [-1, 256, 8, 8]         589,824
     BatchNorm2d-578           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-579            [-1, 256, 8, 8]             512
      Bottleneck-580           [-1, 1024, 8, 8]               0
          Conv2d-581           [-1, 1024, 8, 8]         262,144
          Conv2d-582            [-1, 256, 8, 8]         262,144
     BatchNorm2d-583           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-584            [-1, 256, 8, 8]             512
      Bottleneck-585           [-1, 1024, 8, 8]               0
          Conv2d-586            [-1, 256, 8, 8]         589,824
          Conv2d-587            [-1, 256, 8, 8]         262,144
     BatchNorm2d-588            [-1, 256, 8, 8]             512
     BatchNorm2d-589            [-1, 256, 8, 8]             512
          Conv2d-590           [-1, 1024, 8, 8]         262,144
          Conv2d-591            [-1, 256, 8, 8]         589,824
     BatchNorm2d-592           [-1, 1024, 8, 8]           2,048
      Bottleneck-593           [-1, 1024, 8, 8]               0
     BatchNorm2d-594            [-1, 256, 8, 8]             512
          Conv2d-595            [-1, 256, 8, 8]         262,144
          Conv2d-596           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-597            [-1, 256, 8, 8]             512
     BatchNorm2d-598           [-1, 1024, 8, 8]           2,048
          Conv2d-599            [-1, 256, 8, 8]         589,824
      Bottleneck-600           [-1, 1024, 8, 8]               0
     BatchNorm2d-601            [-1, 256, 8, 8]             512
          Conv2d-602            [-1, 256, 8, 8]         262,144
          Conv2d-603           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-604            [-1, 256, 8, 8]             512
     BatchNorm2d-605           [-1, 1024, 8, 8]           2,048
          Conv2d-606            [-1, 256, 8, 8]         589,824
      Bottleneck-607           [-1, 1024, 8, 8]               0
          Conv2d-608            [-1, 256, 8, 8]         262,144
     BatchNorm2d-609            [-1, 256, 8, 8]             512
          Conv2d-610           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-611            [-1, 256, 8, 8]             512
     BatchNorm2d-612           [-1, 1024, 8, 8]           2,048
          Conv2d-613            [-1, 256, 8, 8]         589,824
      Bottleneck-614           [-1, 1024, 8, 8]               0
     BatchNorm2d-615            [-1, 256, 8, 8]             512
          Conv2d-616            [-1, 256, 8, 8]         262,144
          Conv2d-617           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-618            [-1, 256, 8, 8]             512
     BatchNorm2d-619           [-1, 1024, 8, 8]           2,048
          Conv2d-620            [-1, 256, 8, 8]         589,824
      Bottleneck-621           [-1, 1024, 8, 8]               0
          Conv2d-622            [-1, 256, 8, 8]         262,144
     BatchNorm2d-623            [-1, 256, 8, 8]             512
     BatchNorm2d-624            [-1, 256, 8, 8]             512
          Conv2d-625           [-1, 1024, 8, 8]         262,144
          Conv2d-626            [-1, 256, 8, 8]         589,824
     BatchNorm2d-627           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-628            [-1, 256, 8, 8]             512
      Bottleneck-629           [-1, 1024, 8, 8]               0
          Conv2d-630            [-1, 256, 8, 8]         262,144
          Conv2d-631           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-632            [-1, 256, 8, 8]             512
     BatchNorm2d-633           [-1, 1024, 8, 8]           2,048
          Conv2d-634            [-1, 256, 8, 8]         589,824
      Bottleneck-635           [-1, 1024, 8, 8]               0
     BatchNorm2d-636            [-1, 256, 8, 8]             512
          Conv2d-637            [-1, 256, 8, 8]         262,144
     BatchNorm2d-638            [-1, 256, 8, 8]             512
          Conv2d-639           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-640           [-1, 1024, 8, 8]           2,048
          Conv2d-641            [-1, 256, 8, 8]         589,824
      Bottleneck-642           [-1, 1024, 8, 8]               0
     BatchNorm2d-643            [-1, 256, 8, 8]             512
          Conv2d-644            [-1, 256, 8, 8]         262,144
          Conv2d-645           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-646            [-1, 256, 8, 8]             512
     BatchNorm2d-647           [-1, 1024, 8, 8]           2,048
          Conv2d-648            [-1, 256, 8, 8]         589,824
      Bottleneck-649           [-1, 1024, 8, 8]               0
     BatchNorm2d-650            [-1, 256, 8, 8]             512
          Conv2d-651           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-652           [-1, 1024, 8, 8]           2,048
      Bottleneck-653           [-1, 1024, 8, 8]               0
          Conv2d-654            [-1, 256, 8, 8]         262,144
     BatchNorm2d-655            [-1, 256, 8, 8]             512
          Conv2d-656            [-1, 256, 8, 8]         589,824
     BatchNorm2d-657            [-1, 256, 8, 8]             512
          Conv2d-658           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-659           [-1, 1024, 8, 8]           2,048
      Bottleneck-660           [-1, 1024, 8, 8]               0
          Conv2d-661            [-1, 256, 8, 8]         262,144
     BatchNorm2d-662            [-1, 256, 8, 8]             512
          Conv2d-663            [-1, 256, 8, 8]         589,824
     BatchNorm2d-664            [-1, 256, 8, 8]             512
          Conv2d-665           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-666           [-1, 1024, 8, 8]           2,048
      Bottleneck-667           [-1, 1024, 8, 8]               0
          Conv2d-668            [-1, 256, 8, 8]         262,144
     BatchNorm2d-669            [-1, 256, 8, 8]             512
          Conv2d-670            [-1, 256, 8, 8]         589,824
     BatchNorm2d-671            [-1, 256, 8, 8]             512
          Conv2d-672           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-673           [-1, 1024, 8, 8]           2,048
      Bottleneck-674           [-1, 1024, 8, 8]               0
          Conv2d-675            [-1, 512, 8, 8]         524,288
     BatchNorm2d-676            [-1, 512, 8, 8]           1,024
          Conv2d-677            [-1, 512, 8, 8]         524,288
     BatchNorm2d-678            [-1, 512, 8, 8]           1,024
          Conv2d-679            [-1, 512, 4, 4]       2,359,296
          Conv2d-680            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-681            [-1, 512, 4, 4]           1,024
     BatchNorm2d-682            [-1, 512, 4, 4]           1,024
          Conv2d-683           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-684           [-1, 2048, 4, 4]           4,096
          Conv2d-685           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-686           [-1, 2048, 4, 4]           4,096
          Conv2d-687           [-1, 2048, 4, 4]       2,097,152
          Conv2d-688           [-1, 2048, 4, 4]       2,097,152
     BatchNorm2d-689           [-1, 2048, 4, 4]           4,096
      Bottleneck-690           [-1, 2048, 4, 4]               0
     BatchNorm2d-691           [-1, 2048, 4, 4]           4,096
      Bottleneck-692           [-1, 2048, 4, 4]               0
          Conv2d-693            [-1, 512, 4, 4]       1,048,576
          Conv2d-694            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-695            [-1, 512, 4, 4]           1,024
     BatchNorm2d-696            [-1, 512, 4, 4]           1,024
          Conv2d-697            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-698            [-1, 512, 4, 4]           1,024
          Conv2d-699            [-1, 512, 4, 4]       2,359,296
          Conv2d-700           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-701            [-1, 512, 4, 4]           1,024
     BatchNorm2d-702           [-1, 2048, 4, 4]           4,096
          Conv2d-703           [-1, 2048, 4, 4]       1,048,576
      Bottleneck-704           [-1, 2048, 4, 4]               0
     BatchNorm2d-705           [-1, 2048, 4, 4]           4,096
          Conv2d-706            [-1, 512, 4, 4]       1,048,576
      Bottleneck-707           [-1, 2048, 4, 4]               0
     BatchNorm2d-708            [-1, 512, 4, 4]           1,024
          Conv2d-709            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-710            [-1, 512, 4, 4]           1,024
          Conv2d-711            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-712            [-1, 512, 4, 4]           1,024
          Conv2d-713            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-714            [-1, 512, 4, 4]           1,024
          Conv2d-715           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-716           [-1, 2048, 4, 4]           4,096
          Conv2d-717           [-1, 2048, 4, 4]       1,048,576
      Bottleneck-718           [-1, 2048, 4, 4]               0
     BatchNorm2d-719           [-1, 2048, 4, 4]           4,096
      Bottleneck-720           [-1, 2048, 4, 4]               0
          Linear-721                   [-1, 10]          20,490
          ResNet-722                   [-1, 10]               0
          Linear-723                   [-1, 10]          20,490
          ResNet-724                   [-1, 10]               0
================================================================
Total params: 116,313,236
Trainable params: 116,313,236
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 284.25
Params size (MB): 443.70
Estimated Total Size (MB): 727.96
----------------------------------------------------------------