# 大体同じものが出力されるはずだが，表示される順番が異なることがあるので注意．
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]           1,728
            Conv2d-2           [-1, 64, 32, 32]           1,728
       BatchNorm2d-3           [-1, 64, 32, 32]             128
       BatchNorm2d-4           [-1, 64, 32, 32]             128
            Conv2d-5           [-1, 64, 32, 32]           4,096
            Conv2d-6           [-1, 64, 32, 32]           4,096
       BatchNorm2d-7           [-1, 64, 32, 32]             128
       BatchNorm2d-8           [-1, 64, 32, 32]             128
            Conv2d-9           [-1, 64, 32, 32]          36,864
      BatchNorm2d-10           [-1, 64, 32, 32]             128
           Conv2d-11           [-1, 64, 32, 32]          36,864
      BatchNorm2d-12           [-1, 64, 32, 32]             128
           Conv2d-13          [-1, 256, 32, 32]          16,384
           Conv2d-14          [-1, 256, 32, 32]          16,384
      BatchNorm2d-15          [-1, 256, 32, 32]             512
      BatchNorm2d-16          [-1, 256, 32, 32]             512
           Conv2d-17          [-1, 256, 32, 32]          16,384
           Conv2d-18          [-1, 256, 32, 32]          16,384
      BatchNorm2d-19          [-1, 256, 32, 32]             512
      BatchNorm2d-20          [-1, 256, 32, 32]             512
       Bottleneck-21          [-1, 256, 32, 32]               0
       Bottleneck-22          [-1, 256, 32, 32]               0
           Conv2d-23           [-1, 64, 32, 32]          16,384
      BatchNorm2d-24           [-1, 64, 32, 32]             128
           Conv2d-25           [-1, 64, 32, 32]          16,384
           Conv2d-26           [-1, 64, 32, 32]          36,864
      BatchNorm2d-27           [-1, 64, 32, 32]             128
      BatchNorm2d-28           [-1, 64, 32, 32]             128
           Conv2d-29           [-1, 64, 32, 32]          36,864
           Conv2d-30          [-1, 256, 32, 32]          16,384
      BatchNorm2d-31           [-1, 64, 32, 32]             128
           Conv2d-32          [-1, 256, 32, 32]          16,384
      BatchNorm2d-33          [-1, 256, 32, 32]             512
       Bottleneck-34          [-1, 256, 32, 32]               0
      BatchNorm2d-35          [-1, 256, 32, 32]             512
           Conv2d-36           [-1, 64, 32, 32]          16,384
       Bottleneck-37          [-1, 256, 32, 32]               0
           Conv2d-38           [-1, 64, 32, 32]          16,384
      BatchNorm2d-39           [-1, 64, 32, 32]             128
      BatchNorm2d-40           [-1, 64, 32, 32]             128
           Conv2d-41           [-1, 64, 32, 32]          36,864
           Conv2d-42           [-1, 64, 32, 32]          36,864
      BatchNorm2d-43           [-1, 64, 32, 32]             128
      BatchNorm2d-44           [-1, 64, 32, 32]             128
           Conv2d-45          [-1, 256, 32, 32]          16,384
           Conv2d-46          [-1, 256, 32, 32]          16,384
      BatchNorm2d-47          [-1, 256, 32, 32]             512
      BatchNorm2d-48          [-1, 256, 32, 32]             512
       Bottleneck-49          [-1, 256, 32, 32]               0
       Bottleneck-50          [-1, 256, 32, 32]               0
           Conv2d-51          [-1, 128, 32, 32]          32,768
      BatchNorm2d-52          [-1, 128, 32, 32]             256
           Conv2d-53          [-1, 128, 32, 32]          32,768
      BatchNorm2d-54          [-1, 128, 32, 32]             256
           Conv2d-55          [-1, 128, 16, 16]         147,456
      BatchNorm2d-56          [-1, 128, 16, 16]             256
           Conv2d-57          [-1, 128, 16, 16]         147,456
      BatchNorm2d-58          [-1, 128, 16, 16]             256
           Conv2d-59          [-1, 512, 16, 16]          65,536
           Conv2d-60          [-1, 512, 16, 16]          65,536
      BatchNorm2d-61          [-1, 512, 16, 16]           1,024
           Conv2d-62          [-1, 512, 16, 16]         131,072
      BatchNorm2d-63          [-1, 512, 16, 16]           1,024
      BatchNorm2d-64          [-1, 512, 16, 16]           1,024
           Conv2d-65          [-1, 512, 16, 16]         131,072
       Bottleneck-66          [-1, 512, 16, 16]               0
      BatchNorm2d-67          [-1, 512, 16, 16]           1,024
       Bottleneck-68          [-1, 512, 16, 16]               0
           Conv2d-69          [-1, 128, 16, 16]          65,536
      BatchNorm2d-70          [-1, 128, 16, 16]             256
           Conv2d-71          [-1, 128, 16, 16]          65,536
      BatchNorm2d-72          [-1, 128, 16, 16]             256
           Conv2d-73          [-1, 128, 16, 16]         147,456
      BatchNorm2d-74          [-1, 128, 16, 16]             256
           Conv2d-75          [-1, 512, 16, 16]          65,536
      BatchNorm2d-76          [-1, 512, 16, 16]           1,024
       Bottleneck-77          [-1, 512, 16, 16]               0
           Conv2d-78          [-1, 128, 16, 16]          65,536
           Conv2d-79          [-1, 128, 16, 16]         147,456
      BatchNorm2d-80          [-1, 128, 16, 16]             256
      BatchNorm2d-81          [-1, 128, 16, 16]             256
           Conv2d-82          [-1, 128, 16, 16]         147,456
      BatchNorm2d-83          [-1, 128, 16, 16]             256
           Conv2d-84          [-1, 512, 16, 16]          65,536
           Conv2d-85          [-1, 512, 16, 16]          65,536
      BatchNorm2d-86          [-1, 512, 16, 16]           1,024
      BatchNorm2d-87          [-1, 512, 16, 16]           1,024
       Bottleneck-88          [-1, 512, 16, 16]               0
       Bottleneck-89          [-1, 512, 16, 16]               0
           Conv2d-90          [-1, 128, 16, 16]          65,536
           Conv2d-91          [-1, 128, 16, 16]          65,536
      BatchNorm2d-92          [-1, 128, 16, 16]             256
      BatchNorm2d-93          [-1, 128, 16, 16]             256
           Conv2d-94          [-1, 128, 16, 16]         147,456
           Conv2d-95          [-1, 128, 16, 16]         147,456
      BatchNorm2d-96          [-1, 128, 16, 16]             256
      BatchNorm2d-97          [-1, 128, 16, 16]             256
           Conv2d-98          [-1, 512, 16, 16]          65,536
           Conv2d-99          [-1, 512, 16, 16]          65,536
     BatchNorm2d-100          [-1, 512, 16, 16]           1,024
     BatchNorm2d-101          [-1, 512, 16, 16]           1,024
      Bottleneck-102          [-1, 512, 16, 16]               0
      Bottleneck-103          [-1, 512, 16, 16]               0
          Conv2d-104          [-1, 128, 16, 16]          65,536
     BatchNorm2d-105          [-1, 128, 16, 16]             256
          Conv2d-106          [-1, 128, 16, 16]         147,456
     BatchNorm2d-107          [-1, 128, 16, 16]             256
          Conv2d-108          [-1, 512, 16, 16]          65,536
     BatchNorm2d-109          [-1, 512, 16, 16]           1,024
      Bottleneck-110          [-1, 512, 16, 16]               0
          Conv2d-111          [-1, 256, 16, 16]         131,072
          Conv2d-112          [-1, 256, 16, 16]         131,072
     BatchNorm2d-113          [-1, 256, 16, 16]             512
     BatchNorm2d-114          [-1, 256, 16, 16]             512
          Conv2d-115            [-1, 256, 8, 8]         589,824
     BatchNorm2d-116            [-1, 256, 8, 8]             512
          Conv2d-117            [-1, 256, 8, 8]         589,824
     BatchNorm2d-118            [-1, 256, 8, 8]             512
          Conv2d-119           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-120           [-1, 1024, 8, 8]           2,048
          Conv2d-121           [-1, 1024, 8, 8]         524,288
     BatchNorm2d-122           [-1, 1024, 8, 8]           2,048
      Bottleneck-123           [-1, 1024, 8, 8]               0
          Conv2d-124           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-125           [-1, 1024, 8, 8]           2,048
          Conv2d-126           [-1, 1024, 8, 8]         524,288
     BatchNorm2d-127           [-1, 1024, 8, 8]           2,048
      Bottleneck-128           [-1, 1024, 8, 8]               0
          Conv2d-129            [-1, 256, 8, 8]         262,144
          Conv2d-130            [-1, 256, 8, 8]         262,144
     BatchNorm2d-131            [-1, 256, 8, 8]             512
     BatchNorm2d-132            [-1, 256, 8, 8]             512
          Conv2d-133            [-1, 256, 8, 8]         589,824
     BatchNorm2d-134            [-1, 256, 8, 8]             512
          Conv2d-135           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-136           [-1, 1024, 8, 8]           2,048
      Bottleneck-137           [-1, 1024, 8, 8]               0
          Conv2d-138            [-1, 256, 8, 8]         262,144
     BatchNorm2d-139            [-1, 256, 8, 8]             512
          Conv2d-140            [-1, 256, 8, 8]         589,824
     BatchNorm2d-141            [-1, 256, 8, 8]             512
          Conv2d-142            [-1, 256, 8, 8]         589,824
          Conv2d-143           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-144            [-1, 256, 8, 8]             512
     BatchNorm2d-145           [-1, 1024, 8, 8]           2,048
      Bottleneck-146           [-1, 1024, 8, 8]               0
          Conv2d-147           [-1, 1024, 8, 8]         262,144
          Conv2d-148            [-1, 256, 8, 8]         262,144
     BatchNorm2d-149           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-150            [-1, 256, 8, 8]             512
      Bottleneck-151           [-1, 1024, 8, 8]               0
          Conv2d-152            [-1, 256, 8, 8]         589,824
          Conv2d-153            [-1, 256, 8, 8]         262,144
     BatchNorm2d-154            [-1, 256, 8, 8]             512
     BatchNorm2d-155            [-1, 256, 8, 8]             512
          Conv2d-156           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-157           [-1, 1024, 8, 8]           2,048
          Conv2d-158            [-1, 256, 8, 8]         589,824
      Bottleneck-159           [-1, 1024, 8, 8]               0
     BatchNorm2d-160            [-1, 256, 8, 8]             512
          Conv2d-161            [-1, 256, 8, 8]         262,144
          Conv2d-162           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-163            [-1, 256, 8, 8]             512
     BatchNorm2d-164           [-1, 1024, 8, 8]           2,048
          Conv2d-165            [-1, 256, 8, 8]         589,824
      Bottleneck-166           [-1, 1024, 8, 8]               0
          Conv2d-167            [-1, 256, 8, 8]         262,144
     BatchNorm2d-168            [-1, 256, 8, 8]             512
     BatchNorm2d-169            [-1, 256, 8, 8]             512
          Conv2d-170           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-171           [-1, 1024, 8, 8]           2,048
          Conv2d-172            [-1, 256, 8, 8]         589,824
      Bottleneck-173           [-1, 1024, 8, 8]               0
     BatchNorm2d-174            [-1, 256, 8, 8]             512
          Conv2d-175            [-1, 256, 8, 8]         262,144
          Conv2d-176           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-177            [-1, 256, 8, 8]             512
     BatchNorm2d-178           [-1, 1024, 8, 8]           2,048
          Conv2d-179            [-1, 256, 8, 8]         589,824
      Bottleneck-180           [-1, 1024, 8, 8]               0
     BatchNorm2d-181            [-1, 256, 8, 8]             512
          Conv2d-182            [-1, 256, 8, 8]         262,144
     BatchNorm2d-183            [-1, 256, 8, 8]             512
          Conv2d-184           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-185           [-1, 1024, 8, 8]           2,048
          Conv2d-186            [-1, 256, 8, 8]         589,824
      Bottleneck-187           [-1, 1024, 8, 8]               0
     BatchNorm2d-188            [-1, 256, 8, 8]             512
          Conv2d-189            [-1, 256, 8, 8]         262,144
          Conv2d-190           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-191            [-1, 256, 8, 8]             512
     BatchNorm2d-192           [-1, 1024, 8, 8]           2,048
          Conv2d-193            [-1, 256, 8, 8]         589,824
      Bottleneck-194           [-1, 1024, 8, 8]               0
     BatchNorm2d-195            [-1, 256, 8, 8]             512
          Conv2d-196            [-1, 256, 8, 8]         262,144
          Conv2d-197           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-198            [-1, 256, 8, 8]             512
     BatchNorm2d-199           [-1, 1024, 8, 8]           2,048
          Conv2d-200            [-1, 256, 8, 8]         589,824
      Bottleneck-201           [-1, 1024, 8, 8]               0
     BatchNorm2d-202            [-1, 256, 8, 8]             512
          Conv2d-203            [-1, 256, 8, 8]         262,144
     BatchNorm2d-204            [-1, 256, 8, 8]             512
          Conv2d-205           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-206           [-1, 1024, 8, 8]           2,048
          Conv2d-207            [-1, 256, 8, 8]         589,824
      Bottleneck-208           [-1, 1024, 8, 8]               0
     BatchNorm2d-209            [-1, 256, 8, 8]             512
          Conv2d-210            [-1, 256, 8, 8]         262,144
          Conv2d-211           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-212            [-1, 256, 8, 8]             512
     BatchNorm2d-213           [-1, 1024, 8, 8]           2,048
          Conv2d-214            [-1, 256, 8, 8]         589,824
      Bottleneck-215           [-1, 1024, 8, 8]               0
     BatchNorm2d-216            [-1, 256, 8, 8]             512
          Conv2d-217            [-1, 256, 8, 8]         262,144
     BatchNorm2d-218            [-1, 256, 8, 8]             512
          Conv2d-219           [-1, 1024, 8, 8]         262,144
          Conv2d-220            [-1, 256, 8, 8]         589,824
     BatchNorm2d-221           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-222            [-1, 256, 8, 8]             512
      Bottleneck-223           [-1, 1024, 8, 8]               0
          Conv2d-224            [-1, 256, 8, 8]         262,144
          Conv2d-225           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-226            [-1, 256, 8, 8]             512
     BatchNorm2d-227           [-1, 1024, 8, 8]           2,048
      Bottleneck-228           [-1, 1024, 8, 8]               0
          Conv2d-229            [-1, 256, 8, 8]         589,824
          Conv2d-230            [-1, 256, 8, 8]         262,144
     BatchNorm2d-231            [-1, 256, 8, 8]             512
     BatchNorm2d-232            [-1, 256, 8, 8]             512
          Conv2d-233           [-1, 1024, 8, 8]         262,144
          Conv2d-234            [-1, 256, 8, 8]         589,824
     BatchNorm2d-235           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-236            [-1, 256, 8, 8]             512
      Bottleneck-237           [-1, 1024, 8, 8]               0
          Conv2d-238            [-1, 256, 8, 8]         262,144
          Conv2d-239           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-240            [-1, 256, 8, 8]             512
     BatchNorm2d-241           [-1, 1024, 8, 8]           2,048
      Bottleneck-242           [-1, 1024, 8, 8]               0
          Conv2d-243            [-1, 256, 8, 8]         262,144
          Conv2d-244            [-1, 256, 8, 8]         589,824
     BatchNorm2d-245            [-1, 256, 8, 8]             512
     BatchNorm2d-246            [-1, 256, 8, 8]             512
          Conv2d-247            [-1, 256, 8, 8]         589,824
          Conv2d-248           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-249            [-1, 256, 8, 8]             512
     BatchNorm2d-250           [-1, 1024, 8, 8]           2,048
      Bottleneck-251           [-1, 1024, 8, 8]               0
          Conv2d-252           [-1, 1024, 8, 8]         262,144
          Conv2d-253            [-1, 256, 8, 8]         262,144
     BatchNorm2d-254           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-255            [-1, 256, 8, 8]             512
      Bottleneck-256           [-1, 1024, 8, 8]               0
          Conv2d-257            [-1, 256, 8, 8]         262,144
          Conv2d-258            [-1, 256, 8, 8]         589,824
     BatchNorm2d-259            [-1, 256, 8, 8]             512
     BatchNorm2d-260            [-1, 256, 8, 8]             512
          Conv2d-261           [-1, 1024, 8, 8]         262,144
          Conv2d-262            [-1, 256, 8, 8]         589,824
     BatchNorm2d-263           [-1, 1024, 8, 8]           2,048
      Bottleneck-264           [-1, 1024, 8, 8]               0
     BatchNorm2d-265            [-1, 256, 8, 8]             512
          Conv2d-266            [-1, 256, 8, 8]         262,144
     BatchNorm2d-267            [-1, 256, 8, 8]             512
          Conv2d-268           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-269           [-1, 1024, 8, 8]           2,048
          Conv2d-270            [-1, 256, 8, 8]         589,824
      Bottleneck-271           [-1, 1024, 8, 8]               0
     BatchNorm2d-272            [-1, 256, 8, 8]             512
          Conv2d-273            [-1, 256, 8, 8]         262,144
          Conv2d-274           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-275            [-1, 256, 8, 8]             512
     BatchNorm2d-276           [-1, 1024, 8, 8]           2,048
          Conv2d-277            [-1, 256, 8, 8]         589,824
      Bottleneck-278           [-1, 1024, 8, 8]               0
     BatchNorm2d-279            [-1, 256, 8, 8]             512
          Conv2d-280            [-1, 256, 8, 8]         262,144
          Conv2d-281           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-282            [-1, 256, 8, 8]             512
     BatchNorm2d-283           [-1, 1024, 8, 8]           2,048
          Conv2d-284            [-1, 256, 8, 8]         589,824
      Bottleneck-285           [-1, 1024, 8, 8]               0
     BatchNorm2d-286            [-1, 256, 8, 8]             512
          Conv2d-287            [-1, 256, 8, 8]         262,144
          Conv2d-288           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-289            [-1, 256, 8, 8]             512
     BatchNorm2d-290           [-1, 1024, 8, 8]           2,048
          Conv2d-291            [-1, 256, 8, 8]         589,824
      Bottleneck-292           [-1, 1024, 8, 8]               0
     BatchNorm2d-293            [-1, 256, 8, 8]             512
          Conv2d-294            [-1, 256, 8, 8]         262,144
          Conv2d-295           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-296            [-1, 256, 8, 8]             512
     BatchNorm2d-297           [-1, 1024, 8, 8]           2,048
          Conv2d-298            [-1, 256, 8, 8]         589,824
      Bottleneck-299           [-1, 1024, 8, 8]               0
          Conv2d-300            [-1, 256, 8, 8]         262,144
     BatchNorm2d-301            [-1, 256, 8, 8]             512
     BatchNorm2d-302            [-1, 256, 8, 8]             512
          Conv2d-303           [-1, 1024, 8, 8]         262,144
          Conv2d-304            [-1, 256, 8, 8]         589,824
     BatchNorm2d-305           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-306            [-1, 256, 8, 8]             512
      Bottleneck-307           [-1, 1024, 8, 8]               0
          Conv2d-308            [-1, 256, 8, 8]         262,144
          Conv2d-309           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-310            [-1, 256, 8, 8]             512
     BatchNorm2d-311           [-1, 1024, 8, 8]           2,048
          Conv2d-312            [-1, 256, 8, 8]         589,824
      Bottleneck-313           [-1, 1024, 8, 8]               0
          Conv2d-314            [-1, 256, 8, 8]         262,144
     BatchNorm2d-315            [-1, 256, 8, 8]             512
     BatchNorm2d-316            [-1, 256, 8, 8]             512
          Conv2d-317           [-1, 1024, 8, 8]         262,144
          Conv2d-318            [-1, 256, 8, 8]         589,824
     BatchNorm2d-319           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-320            [-1, 256, 8, 8]             512
      Bottleneck-321           [-1, 1024, 8, 8]               0
          Conv2d-322           [-1, 1024, 8, 8]         262,144
          Conv2d-323            [-1, 256, 8, 8]         262,144
     BatchNorm2d-324           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-325            [-1, 256, 8, 8]             512
      Bottleneck-326           [-1, 1024, 8, 8]               0
          Conv2d-327            [-1, 256, 8, 8]         589,824
          Conv2d-328            [-1, 256, 8, 8]         262,144
     BatchNorm2d-329            [-1, 256, 8, 8]             512
     BatchNorm2d-330            [-1, 256, 8, 8]             512
          Conv2d-331           [-1, 1024, 8, 8]         262,144
          Conv2d-332            [-1, 256, 8, 8]         589,824
     BatchNorm2d-333           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-334            [-1, 256, 8, 8]             512
      Bottleneck-335           [-1, 1024, 8, 8]               0
          Conv2d-336            [-1, 256, 8, 8]         262,144
          Conv2d-337           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-338            [-1, 256, 8, 8]             512
     BatchNorm2d-339           [-1, 1024, 8, 8]           2,048
      Bottleneck-340           [-1, 1024, 8, 8]               0
          Conv2d-341            [-1, 256, 8, 8]         589,824
          Conv2d-342            [-1, 256, 8, 8]         262,144
     BatchNorm2d-343            [-1, 256, 8, 8]             512
     BatchNorm2d-344            [-1, 256, 8, 8]             512
          Conv2d-345            [-1, 256, 8, 8]         589,824
          Conv2d-346           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-347            [-1, 256, 8, 8]             512
     BatchNorm2d-348           [-1, 1024, 8, 8]           2,048
      Bottleneck-349           [-1, 1024, 8, 8]               0
          Conv2d-350           [-1, 1024, 8, 8]         262,144
          Conv2d-351            [-1, 256, 8, 8]         262,144
     BatchNorm2d-352           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-353            [-1, 256, 8, 8]             512
      Bottleneck-354           [-1, 1024, 8, 8]               0
          Conv2d-355            [-1, 256, 8, 8]         262,144
          Conv2d-356            [-1, 256, 8, 8]         589,824
     BatchNorm2d-357            [-1, 256, 8, 8]             512
     BatchNorm2d-358            [-1, 256, 8, 8]             512
          Conv2d-359           [-1, 1024, 8, 8]         262,144
          Conv2d-360            [-1, 256, 8, 8]         589,824
     BatchNorm2d-361           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-362            [-1, 256, 8, 8]             512
      Bottleneck-363           [-1, 1024, 8, 8]               0
          Conv2d-364           [-1, 1024, 8, 8]         262,144
          Conv2d-365            [-1, 256, 8, 8]         262,144
     BatchNorm2d-366           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-367            [-1, 256, 8, 8]             512
      Bottleneck-368           [-1, 1024, 8, 8]               0
          Conv2d-369            [-1, 256, 8, 8]         262,144
          Conv2d-370            [-1, 256, 8, 8]         589,824
     BatchNorm2d-371            [-1, 256, 8, 8]             512
     BatchNorm2d-372            [-1, 256, 8, 8]             512
          Conv2d-373            [-1, 256, 8, 8]         589,824
          Conv2d-374           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-375            [-1, 256, 8, 8]             512
     BatchNorm2d-376           [-1, 1024, 8, 8]           2,048
      Bottleneck-377           [-1, 1024, 8, 8]               0
          Conv2d-378           [-1, 1024, 8, 8]         262,144
          Conv2d-379            [-1, 256, 8, 8]         262,144
     BatchNorm2d-380           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-381            [-1, 256, 8, 8]             512
      Bottleneck-382           [-1, 1024, 8, 8]               0
          Conv2d-383            [-1, 256, 8, 8]         262,144
          Conv2d-384            [-1, 256, 8, 8]         589,824
     BatchNorm2d-385            [-1, 256, 8, 8]             512
     BatchNorm2d-386            [-1, 256, 8, 8]             512
          Conv2d-387           [-1, 1024, 8, 8]         262,144
          Conv2d-388            [-1, 256, 8, 8]         589,824
     BatchNorm2d-389            [-1, 256, 8, 8]             512
     BatchNorm2d-390           [-1, 1024, 8, 8]           2,048
      Bottleneck-391           [-1, 1024, 8, 8]               0
          Conv2d-392           [-1, 1024, 8, 8]         262,144
          Conv2d-393            [-1, 256, 8, 8]         262,144
     BatchNorm2d-394           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-395            [-1, 256, 8, 8]             512
      Bottleneck-396           [-1, 1024, 8, 8]               0
          Conv2d-397            [-1, 256, 8, 8]         262,144
          Conv2d-398            [-1, 256, 8, 8]         589,824
     BatchNorm2d-399            [-1, 256, 8, 8]             512
     BatchNorm2d-400            [-1, 256, 8, 8]             512
          Conv2d-401            [-1, 256, 8, 8]         589,824
          Conv2d-402           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-403            [-1, 256, 8, 8]             512
     BatchNorm2d-404           [-1, 1024, 8, 8]           2,048
          Conv2d-405           [-1, 1024, 8, 8]         262,144
      Bottleneck-406           [-1, 1024, 8, 8]               0
          Conv2d-407            [-1, 256, 8, 8]         262,144
     BatchNorm2d-408           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-409            [-1, 256, 8, 8]             512
      Bottleneck-410           [-1, 1024, 8, 8]               0
          Conv2d-411            [-1, 256, 8, 8]         589,824
          Conv2d-412            [-1, 256, 8, 8]         262,144
     BatchNorm2d-413            [-1, 256, 8, 8]             512
     BatchNorm2d-414            [-1, 256, 8, 8]             512
          Conv2d-415           [-1, 1024, 8, 8]         262,144
          Conv2d-416            [-1, 256, 8, 8]         589,824
     BatchNorm2d-417           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-418            [-1, 256, 8, 8]             512
      Bottleneck-419           [-1, 1024, 8, 8]               0
          Conv2d-420           [-1, 1024, 8, 8]         262,144
          Conv2d-421            [-1, 256, 8, 8]         262,144
     BatchNorm2d-422           [-1, 1024, 8, 8]           2,048
     BatchNorm2d-423            [-1, 256, 8, 8]             512
      Bottleneck-424           [-1, 1024, 8, 8]               0
          Conv2d-425            [-1, 256, 8, 8]         589,824
     BatchNorm2d-426            [-1, 256, 8, 8]             512
          Conv2d-427           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-428           [-1, 1024, 8, 8]           2,048
      Bottleneck-429           [-1, 1024, 8, 8]               0
          Conv2d-430            [-1, 256, 8, 8]         262,144
     BatchNorm2d-431            [-1, 256, 8, 8]             512
          Conv2d-432            [-1, 256, 8, 8]         589,824
     BatchNorm2d-433            [-1, 256, 8, 8]             512
          Conv2d-434           [-1, 1024, 8, 8]         262,144
     BatchNorm2d-435           [-1, 1024, 8, 8]           2,048
      Bottleneck-436           [-1, 1024, 8, 8]               0
          Conv2d-437            [-1, 512, 8, 8]         524,288
     BatchNorm2d-438            [-1, 512, 8, 8]           1,024
          Conv2d-439            [-1, 512, 8, 8]         524,288
     BatchNorm2d-440            [-1, 512, 8, 8]           1,024
          Conv2d-441            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-442            [-1, 512, 4, 4]           1,024
          Conv2d-443            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-444            [-1, 512, 4, 4]           1,024
          Conv2d-445           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-446           [-1, 2048, 4, 4]           4,096
          Conv2d-447           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-448           [-1, 2048, 4, 4]           4,096
          Conv2d-449           [-1, 2048, 4, 4]       2,097,152
     BatchNorm2d-450           [-1, 2048, 4, 4]           4,096
      Bottleneck-451           [-1, 2048, 4, 4]               0
          Conv2d-452           [-1, 2048, 4, 4]       2,097,152
     BatchNorm2d-453           [-1, 2048, 4, 4]           4,096
      Bottleneck-454           [-1, 2048, 4, 4]               0
          Conv2d-455            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-456            [-1, 512, 4, 4]           1,024
          Conv2d-457            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-458            [-1, 512, 4, 4]           1,024
          Conv2d-459            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-460            [-1, 512, 4, 4]           1,024
          Conv2d-461           [-1, 2048, 4, 4]       1,048,576
          Conv2d-462            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-463           [-1, 2048, 4, 4]           4,096
      Bottleneck-464           [-1, 2048, 4, 4]               0
     BatchNorm2d-465            [-1, 512, 4, 4]           1,024
          Conv2d-466            [-1, 512, 4, 4]       1,048,576
          Conv2d-467           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-468            [-1, 512, 4, 4]           1,024
     BatchNorm2d-469           [-1, 2048, 4, 4]           4,096
      Bottleneck-470           [-1, 2048, 4, 4]               0
          Conv2d-471            [-1, 512, 4, 4]       2,359,296
          Conv2d-472            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-473            [-1, 512, 4, 4]           1,024
     BatchNorm2d-474            [-1, 512, 4, 4]           1,024
          Conv2d-475            [-1, 512, 4, 4]       2,359,296
          Conv2d-476           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-477            [-1, 512, 4, 4]           1,024
     BatchNorm2d-478           [-1, 2048, 4, 4]           4,096
          Conv2d-479           [-1, 2048, 4, 4]       1,048,576
      Bottleneck-480           [-1, 2048, 4, 4]               0
     BatchNorm2d-481           [-1, 2048, 4, 4]           4,096
      Bottleneck-482           [-1, 2048, 4, 4]               0
          Linear-483                   [-1, 10]          20,490
          ResNet-484                   [-1, 10]               0
          Linear-485                   [-1, 10]          20,490
          ResNet-486                   [-1, 10]               0
================================================================
Total params: 85,025,940
Trainable params: 85,025,940
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 200.25
Params size (MB): 324.35
Estimated Total Size (MB): 524.61
----------------------------------------------------------------